### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # kubernetes_storage_class_v1.efs[0] will be created
+   resource "kubernetes_storage_class_v1" "efs" {
+       allow_volume_expansion = true
+       id                     = (known after apply)
+       parameters             = (known after apply)
+       reclaim_policy         = "Retain"
+       storage_provisioner    = "efs.csi.aws.com"
+       volume_binding_mode    = "Immediate"

+       metadata {
+           generation       = (known after apply)
+           name             = "jingood2-dev-efs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.efs.data.aws_iam_policy_document.policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "*",
            ]
+           effect    = "Deny"
+           resources = [
+               (known after apply),
            ]
+           sid       = "NonSecureTransport"

+           condition {
+               test     = "Bool"
+               values   = [
+                   "false",
                ]
+               variable = "aws:SecureTransport"
            }

+           principals {
+               identifiers = [
+                   "*",
                ]
+               type        = "AWS"
            }
        }
    }

  # module.efs.aws_efs_backup_policy.this[0] will be created
+   resource "aws_efs_backup_policy" "this" {
+       file_system_id = (known after apply)
+       id             = (known after apply)

+       backup_policy {
+           status = "ENABLED"
        }
    }

  # module.efs.aws_efs_file_system.this[0] will be created
+   resource "aws_efs_file_system" "this" {
+       arn                     = (known after apply)
+       availability_zone_id    = (known after apply)
+       availability_zone_name  = (known after apply)
+       creation_token          = "jingood2-dev-efs"
+       dns_name                = (known after apply)
+       encrypted               = true
+       id                      = (known after apply)
+       kms_key_id              = (known after apply)
+       number_of_mount_targets = (known after apply)
+       owner_id                = (known after apply)
+       performance_mode        = "generalPurpose"
+       size_in_bytes           = (known after apply)
+       tags                    = {
+           "Name"        = "jingood2-dev-efs"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all                = {
+           "Name"        = "jingood2-dev-efs"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       throughput_mode         = "bursting"
    }

  # module.efs.aws_efs_file_system_policy.this[0] will be created
+   resource "aws_efs_file_system_policy" "this" {
+       bypass_policy_lockout_safety_check = false
+       file_system_id                     = (known after apply)
+       id                                 = (known after apply)
+       policy                             = (known after apply)
    }

  # module.efs.aws_efs_mount_target.this["us-east-1a"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = [
+           "sg-05b91b83983d151f5",
+           "sg-09a23936bf95b6dd8",
        ]
+       subnet_id              = "subnet-0295d3a037cfc7c23"
    }

  # module.efs.aws_efs_mount_target.this["us-east-1c"] will be created
+   resource "aws_efs_mount_target" "this" {
+       availability_zone_id   = (known after apply)
+       availability_zone_name = (known after apply)
+       dns_name               = (known after apply)
+       file_system_arn        = (known after apply)
+       file_system_id         = (known after apply)
+       id                     = (known after apply)
+       ip_address             = (known after apply)
+       mount_target_dns_name  = (known after apply)
+       network_interface_id   = (known after apply)
+       owner_id               = (known after apply)
+       security_groups        = [
+           "sg-05b91b83983d151f5",
+           "sg-09a23936bf95b6dd8",
        ]
+       subnet_id              = "subnet-0d102e9e62c553f9a"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>